class Order:
    def __init__(self, items):
        self.items = items

    def calculate_total(self):
        return sum(item.price for item in self.items)


class OrderRepository:
    def save(self, order):
        # сохранение в базу данных
        pass


class InvoicePrinter:
    def print(self, order):
        # печать счёта
        pass

#-----------------------

**Фрагмент A**:
def create_user(email):
    if not email or "@" not in email:
        raise ValueError("Invalid email")
    # ...

def update_user_email(user, email):
    if not email or "@" not in email:
        raise ValueError("Invalid email")
    # ...


#драй
def varification(email):
    if not email or "@" not in email:
            raise ValueError("Invalid email")

**Фрагмент B**:

def get_discount(user):
    return 10 if user.is_premium and user.years > 5 and user.orders > 100 else (5 if user.is_premium and user.orders > 50 else 0)


#кис

def get_discount(user):
    if (user.is_premium and user.years > 5 and user.orders > 100):
        return 10
    elif user.is_premium and user.orders > 50:
        return 5
    else:
        return 0


**Фрагмент C**:
class PaymentProcessor:
    def process(self, method):
        if method == "credit_card":
            # обработка карты
            pass
        elif method == "paypal":
            # обработка PayPal
            pass
        elif method == "crypto":
            # обработка крипты (никто не просил, но на будущее)
            pass

#ягни
class PaymentProcessor:
    def process(self, method):
        if method == "credit_card":
            # обработка карты
                pass
        elif method == "paypal":
            # обработка PayPal
            pass


#--------------------------------------------------------------------------#

Работа в группах. Даны три сценария. Для каждого выберите наиболее подходящий архитектурный стиль и обоснуйте выбор.

**Сценарий A**: Стартап из 5 человек создаёт MVP мобильного приложения для доставки еды. Сроки — 3 месяца, бюджет ограничен. 
    Монолит.
    Обоснование: небольшая команда, создает мвп, средний проект

**Сценарий B**: Крупная страховая компания модернизирует существующую систему управления полисами.
Система работает на устаревшем стеке, есть 20 разработчиков, требуется постепенная миграция.
    Слоистая архитектура.
    Обоснование: необходимость постепенной миграции, наличие множества компонентов, которые нужно интегрировать.

**Сценарий C**: Стриминговый сервис с миллионами пользователей. 
Требуется независимое масштабирование рекомендаций, транскодинга видео и биллинга. 50+ разработчиков в 10 командах.
    Микросервисная архитектура.
    Обоснование: высокая нагрузка, необходимость независимого масштабирования различных компонентов, большое количество разработчиков.


#----------------------------------------------------------------------------#

**Сценарий**: Крупный банк имеет 40 legacy-систем (АБС, CRM, биллинг, скоринг, антифрод и т.д.), написанных на разных языках. Нужно интегрировать их в единую экосистему для мобильного приложения.

**Вопросы**:
1. Что выберете: SOA или микросервисы? Обоснуйте.
    Выбираем SOA.
    Пояснение: у нас имеется 40 крупных готовых систем, которые нужно интегрировать. SOA позволяет использовать существующие системы как сервисы. 
    Микросервисы больше подходят для новых разработок и независимых компонентов, нам не подходит

2. Какие риски у каждого варианта?
    1. SOA: большая зависимость систем друг от друга: если одна система падает, то может пострадать все.
    2. Микросервисы: все существуюшие системы крупные, чтобы разбить их на микросервисы, понадобится много времени и ресурсов.
    придется переписывать код, что вызывает дополнительные риски и нагрузку.

3. Как бы вы поэтапно мигрировали?

    1. Провести анализ всех систем, определить их функциональные блоки и зависимости.
    2. Определить приоритетные системы для интеграции, которые наиболее важны для приложения.
    3. Поступенно внедряем системы, учитывая их приоритет и зависимость друг от друга.

#-----------------------------------------

**Сценарий**: Сервис такси. Есть 4 сервиса: Заказы, Водители, Ценообразование, Уведомления.

**Задача**:
1. Определите, какие события должны публиковаться (минимум 5).
2. Для каждого события укажите: producer, topic, consumers.
3. Опишите, что произойдёт, если сервис Уведомления временно упадёт.
4. Как обеспечить идемпотентность обработчика?

| Событие | Producer | Topic | Consumers | Критичность |
|---------|----------|-------|-----------|-------------|
| ride.requested | Заказы | ride.requests | Водители, Ценообразование | High |
| price.calculated | Ценообразование | ride.prices | Заказы | High |
| driver.accepted | Водители | driver.matches | Заказы, Уведомления | High |
| ride.started | Заказы | ride.status.changes | Уведомления | Medium |
| ride.completed | Заказы | ride.status.changes | Ценообразование, Уведомления | High |

Если сервис Уведомления временно упадёт, события, которые он должен был обработать, будут накапливаться в очереди сообщений. 
После восстановления он сможет обработать все накопленные события и отправить уведомления пользователям.

Идемпотентность обработчика можно обеспечить, используя уникальные идентификаторы для каждого события.

#--------------------------------------------

Сценарий А:
Доминирующие NFR: безопасность, низкая стоимость
QAS: врач открывает карту -> система шифрует данные -> цена разработки в рамках 1 млн руб
Стиль: монолит
Trade-offs: масштабируемость (тяжело расти), надежность (упал один модуль - упало все)
Отложенные NFR: большая доступность (если CRM зависнет на полчаса, клиника не обанкротится)

Сценарий B:
Доминирующие NFR: масштабируемость, скорость
QAS: в час пик заказывают 10 000 такси -> база не падает -> водитель тут же видит заказ
Стиль: микросервисы + Event-Driven
Trade-offs: согласованность (статусы обновляются с задержкой), стоимость (дорогие сервера)
Отложенные NFR: строгая транзакционность (скорость подачи машины важнее мгновенного отчета для бухгалтерии)

Сценарий C:
Доминирующие NFR: согласованность (ACID), аудит
QAS: клиент переводит 10 млн -> система проверяет баланс и пишет лог -> нет ошибок и потерь денег
Стиль: SOA
Trade-offs: скорость (транзакции идут медленнее из-за проверок), гибкость (новую фичу внедрять долго)
Отложенные NFR: низкая задержка

Сценарий D:
Доминирующие NFR: масштабируемость, отказоустойчивость
QAS: 1 млн счетчиков одновременно шлют данные -> брокер принимает их -> нет потерь данных
Стиль: Event-Driven
Trade-offs: сложность (синхронный код тяжело писать и отлаживать), актуальность (отчеты строятся с задержкой)
Отложенные NFR: безопасность

**Обсуждение**: сравните ответы разных команд — почему для одного и того же сценария могут быть выбраны разные стили? Что определяет выбор в первую очередь — NFR или ограничения?
Для одного и того же сценария разные команды могут выбрать разные архитектурные стили из-за различий в приоритетах и ограничениях проекта. Например, одна команда может сосредоточиться на безопасности и надежности 
(монолитный стиль), а другая команда может придавать большее значение масштабируемости и скорости (микросервисы или Event-Driven).
Выбор определяется в первую очередь доминирующими NFR, так как они определяют ключевые характеристики системы, которые должны быть обеспечены. 
Ограничения (бюджет, сроки и ресурсы) тоже играют важную роль, но они вторичны по сравнению с требованиями к функциональности и качеству системы.
